Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.UpgradeRequiredProblemInfo
Problem information of Upgrade Required response.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.UpgradeRequiredProblemInfo.MinimumVersion
Gets or sets the minimum version required for compatibility.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.UpgradeRequiredProblemInfo.RecommendedVersion
Gets or sets the version recommended for compatibility.